cmsis-svd/cmsis-svd/data/Spansion/MB9AFA4xM.svd
        <!-- REGISTER "TIMER1INTCLR" -->
        <register>
          <name>TIMER1INTCLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "TIMER1RIS" -->
        <register>
          <name>TIMER1RIS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER1RIS" -->
            <field>
              <name>TIMER1RIS</name>
              <description>Interrupt Status Register bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1MIS" -->
        <register>
          <name>TIMER1MIS</name>
          <description>Masked Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER1MIS" -->
            <field>
              <name>TIMER1MIS</name>
              <description>Masked Interrupt Status bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1BGLOAD" -->
        <register>
          <name>TIMER1BGLOAD</name>
          <description>Background Load Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER2LOAD" -->
        <register derivedFrom="TIMER1LOAD">
          <name>TIMER2LOAD</name>
          <description>Load Register</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <!-- REGISTER "TIMER2VALUE" -->
        <register derivedFrom="TIMER1VALUE">
          <name>TIMER2VALUE</name>
          <description>Value Register</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "TIMER2CONTROL" -->
        <register derivedFrom="TIMER1CONTROL">
          <name>TIMER2CONTROL</name>
          <description>Control Register</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "TIMER2INTCLR" -->
        <register derivedFrom="TIMER1INTCLR">
          <name>TIMER2INTCLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "TIMER2RIS" -->
        <register derivedFrom="TIMER1RIS">
          <name>TIMER2RIS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "TIMER2MIS" -->
        <register derivedFrom="TIMER1MIS">
          <name>TIMER2MIS</name>
          <description>Masked Interrupt Status Register</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "TIMER2BGLOAD" -->
        <register derivedFrom="TIMER1BGLOAD">
          <name>TIMER2BGLOAD</name>
          <description>Background Load Register</description>
          <addressOffset>0x38</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description> Base Timer I/O Select</description>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description>I/O Select Register</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23_" -->
            <field>
              <name>SEL23_</name>
              <description>I/O select bits for Ch.2/Ch.3 </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01_" -->
            <field>
              <name>SEL01_</name>
              <description>I/O select bits for Ch.0/Ch.1 </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL47" -->
    <peripheral>
      <name>BTIOSEL47</name>
      <description> Base Timer I/O Select</description>
      <groupName>BTIOSEL47</groupName>
      <baseAddress>0x40025300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL4567" -->
        <register>
          <name>BTSEL4567</name>
          <description>I/O Select Register</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL67_" -->
            <field>
              <name>SEL67_</name>
              <description>I/O select bits for Ch.6/Ch.7 </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL45_" -->
            <field>
              <name>SEL45_</name>
              <description>I/O select bits for Ch.4/Ch.5</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
