cmsis-svd/cmsis-svd/data/Spansion/MB9AFA4xM.svd
        <!-- REGISTER "IRQ24MON" -->
        <register>
          <name>IRQ24MON</name>
          <description>IRQ24 Batch Read Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCINT" -->
            <field>
              <name>RTCINT</name>
              <description>RTC interrupt request </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WCINT" -->
            <field>
              <name>WCINT</name>
              <description>Watch counter interrupt request</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UPLLINT" -->
            <field>
              <name>UPLLINT</name>
              <description>Stabilization wait completion interrupt request for USB or USB/Ethernet PLL oscillation.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MPLLINT" -->
            <field>
              <name>MPLLINT</name>
              <description>Stabilization wait completion interrupt request for main PLL oscillation </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SOSCINT" -->
            <field>
              <name>SOSCINT</name>
              <description>Stabilization wait completion interrupt request for sub-clock oscillation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MOSCINT" -->
            <field>
              <name>MOSCINT</name>
              <description>Stabilization wait completion interrupt request for main clock oscillation </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ25MON" -->
        <register>
          <name>IRQ25MON</name>
          <description>IRQ25 Batch Read Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description>Conversion result comparison interrupt request in the corresponding A/D unit 0. </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description>FIFO overrun interrupt request in the corresponding A/D unit 0. </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description>Scan conversion interrupt request in the corresponding A/D unit 0. </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description>Priority conversion interrupt request in the corresponding A/D unit 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ26MON" -->
        <register>
          <name>IRQ26MON</name>
          <description>IRQ26 Batch Read Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description>Conversion result comparison interrupt request in the corresponding A/D unit 1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description>FIFO overrun interrupt request in the corresponding A/D unit 1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description>Scan conversion interrupt request in the corresponding A/D unit 1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description>Priority conversion interrupt request in the corresponding A/D unit 1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ27MON" -->
        <register>
          <name>IRQ27MON</name>
          <description>IRQ27 Batch Read Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x10</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDCINT" -->
            <field>
              <name>LCDCINT</name>
              <description>LCDC interrupt request for LCD controller </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ31MON" -->
        <register>
          <name>IRQ31MON</name>
          <description>IRQ31 Batch Read Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT15" -->
            <field>
              <name>BTINT15</name>
              <description>IRQ1 interrupt request on the base timer ch.7</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT14" -->
            <field>
              <name>BTINT14</name>
              <description>IRQ0 interrupt request on the base timer ch.7</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT13" -->
            <field>
              <name>BTINT13</name>
              <description>IRQ1 interrupt request on the base timer ch.6</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT12" -->
            <field>
              <name>BTINT12</name>
              <description>IRQ0 interrupt request on the base timer ch.6</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT11" -->
            <field>
              <name>BTINT11</name>
              <description>IRQ1 interrupt request on the base timer ch.5</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT10" -->
            <field>
              <name>BTINT10</name>
              <description>IRQ0 interrupt request on the base timer ch.5</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT9" -->
            <field>
              <name>BTINT9</name>
              <description>IRQ1 interrupt request on the base timer ch.4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT8" -->
            <field>
              <name>BTINT8</name>
              <description>IRQ0 interrupt request on the base timer ch.4</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description>IRQ1 interrupt request on the base timer ch.3</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description>IRQ0 interrupt request on the base timer ch.3</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description>IRQ1 interrupt request on the base timer ch.2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description>IRQ0 interrupt request on the base timer ch.2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description>IRQ1 interrupt request on the base timer ch.1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description>IRQ0 interrupt request on the base timer ch.1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>IRQ1 interrupt request on the base timer ch.0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>IRQ0 interrupt request on the base timer ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
