cmsis-svd/cmsis-svd/data/Spansion/MB9AFA4xM.svd
        <!-- REGISTER "LCDRAM00" -->
        <register>
          <name>LCDRAM00</name>
          <description>Display Data Memory Register 00</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 00</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM01" -->
        <register>
          <name>LCDRAM01</name>
          <description>Display Data Memory Register 01</description>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 01</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM02" -->
        <register>
          <name>LCDRAM02</name>
          <description>Display Data Memory Register 02</description>
          <addressOffset>0x1E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 02</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM03" -->
        <register>
          <name>LCDRAM03</name>
          <description>Display Data Memory Register 03</description>
          <addressOffset>0x1F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 03</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM04" -->
        <register>
          <name>LCDRAM04</name>
          <description>Display Data Memory Register 04</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 04</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM05" -->
        <register>
          <name>LCDRAM05</name>
          <description>Display Data Memory Register 05</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 05</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM06" -->
        <register>
          <name>LCDRAM06</name>
          <description>Display Data Memory Register 06</description>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 06</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM07" -->
        <register>
          <name>LCDRAM07</name>
          <description>Display Data Memory Register 07</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 07</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM08" -->
        <register>
          <name>LCDRAM08</name>
          <description>Display Data Memory Register 08</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 08</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
